nxp-mcuxpresso/mcux-sdk/devices/MCXA152/MCXA152.h
/*! @name ADC0_TRIGM_ADC0_TRIG - ADC Trigger input connections */
/*! @{ */

#define INPUTMUX_ADC0_TRIGM_ADC0_TRIG_TRIGIN_MASK (0x3FU)
#define INPUTMUX_ADC0_TRIGM_ADC0_TRIG_TRIGIN_SHIFT (0U)
/*! TRIGIN - ADC0 trigger inputs
 *  0b000000..Reserved
 *  0b000001..ARM_TXEV input is selected
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..CMP1_OUT input is selected
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT0 input is selected
 *  0b001010..CTimer0_MAT1 input is selected
 *  0b001011..CTimer1_MAT0 input is selected
 *  0b001100..CTimer1_MAT1 input is selected
 *  0b001101..CTimer2_MAT0 input is selected
 *  0b001110..CTimer2_MAT1 input is selected
 *  0b001111..LPTMR0 input is selected
 *  0b010000..Reserved
 *  0b010001..QDC0_POS_MATCH0 input is selected
 *  0b010010..PWM0_SM0_OUT_TRIG0 input is selected
 *  0b010011..PWM0_SM0_OUT_TRIG1 input is selected
 *  0b010100..PWM0_SM1_OUT_TRIG0 input is selected
 *  0b010101..PWM0_SM1_OUT_TRIG1 input is selected
 *  0b010110..PWM0_SM2_OUT_TRIG0 input is selected
 *  0b010111..PWM0_SM2_OUT_TRIG1 input is selected
 *  0b011000..Reserved
 *  0b011001..Reserved
 *  0b011010..GPIO0 Pin Event Trig 0 input is selected
 *  0b011011..GPIO1 Pin Event Trig 0 input is selected
 *  0b011100..GPIO2 Pin Event Trig 0 input is selected
 *  0b011101..GPIO3 Pin Event Trig 0 input is selected
 *  0b011110..Reserved
 *  0b011111..WUU
 *  *..
 */
#define INPUTMUX_ADC0_TRIGM_ADC0_TRIG_TRIGIN(x)  (((uint32_t)(((uint32_t)(x)) << INPUTMUX_ADC0_TRIGM_ADC0_TRIG_TRIGIN_SHIFT)) & INPUTMUX_ADC0_TRIGM_ADC0_TRIG_TRIGIN_MASK)
/*! @} */

/* The count of INPUTMUX_ADC0_TRIGM_ADC0_TRIG */
#define INPUTMUX_ADC0_TRIGM_ADC0_TRIG_COUNT      (4U)

/*! @name QDC0_TRIG - QDC0 Trigger Input Connections */
/*! @{ */

#define INPUTMUX_QDC0_TRIG_INP_MASK              (0x3FU)
#define INPUTMUX_QDC0_TRIG_INP_SHIFT             (0U)
/*! INP - QDC0 input connections
 *  0b000000..Reserved
 *  0b000001..ARM_TXEV input is selected
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..CMP1_OUT input is selected
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT2 input is selected
 *  0b001010..CTimer0_MAT3 input is selected
 *  0b001011..CTimer1_MAT2 input is selected
 *  0b001100..CTimer1_MAT3 input is selected
 *  0b001101..CTimer2_MAT2 input is selected
 *  0b001110..CTimer2_MAT3 input is selected
 *  0b001111..QDC0_POS_MATCH0 input is selected
 *  0b010000..PWM0_SM0_OUT_TRIG0 input is selected
 *  0b010001..PWM0_SM0_OUT_TRIG1 input is selected
 *  0b010010..PWM0_SM1_OUT_TRIG0 input is selected
 *  0b010011..PWM0_SM1_OUT_TRIG1 input is selected
 *  0b010100..PWM0_SM2_OUT_TRIG0 input is selected
 *  0b010101..PWM0_SM2_OUT_TRIG1 input is selected
 *  0b010110..Reserved
 *  0b010111..Reserved
 *  0b011000..TRIG_IN0 input is selected
 *  0b011001..TRIG_IN1 input is selected
 *  0b011010..TRIG_IN2 input is selected
 *  0b011011..TRIG_IN3 input is selected
 *  0b011100..TRIG_IN4 input is selected
 *  0b011101..TRIG_IN5 input is selected
 *  0b011110..TRIG_IN6 input is selected
 *  0b011111..TRIG_IN7 input is selected
 *  0b100000..TRIG_IN8 input is selected
 *  0b100001..TRIG_IN9 input is selected
 *  0b100010..TRIG_IN10 input is selected
 *  0b100011..TRIG_IN11 input is selected
 *  0b100100..GPIO0 Pin Event Trig 0 input is selected
 *  0b100101..GPIO1 Pin Event Trig 0 input is selected
 *  0b100110..GPIO2 Pin Event Trig 0 input is selected
 *  0b100111..GPIO3 Pin Event Trig 0 input is selected
 *  *..
 */
#define INPUTMUX_QDC0_TRIG_INP(x)                (((uint32_t)(((uint32_t)(x)) << INPUTMUX_QDC0_TRIG_INP_SHIFT)) & INPUTMUX_QDC0_TRIG_INP_MASK)
/*! @} */

/*! @name QDC0_HOME - QDC0 Trigger Input Connections */
/*! @{ */

#define INPUTMUX_QDC0_HOME_INP_MASK              (0x3FU)
#define INPUTMUX_QDC0_HOME_INP_SHIFT             (0U)
/*! INP - QDC0 input connections
 *  0b000000..Reserved
 *  0b000001..ARM_TXEV input is selected
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..CMP1_OUT input is selected
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT2 input is selected
 *  0b001010..CTimer0_MAT3 input is selected
 *  0b001011..CTimer1_MAT2 input is selected
 *  0b001100..CTimer1_MAT3 input is selected
 *  0b001101..CTimer2_MAT2 input is selected
 *  0b001110..CTimer2_MAT3 input is selected
 *  0b001111..QDC0_POS_MATCH0 input is selected
 *  0b010000..PWM0_SM0_OUT_TRIG0 input is selected
 *  0b010001..PWM0_SM0_OUT_TRIG1 input is selected
 *  0b010010..PWM0_SM1_OUT_TRIG0 input is selected
 *  0b010011..PWM0_SM1_OUT_TRIG1 input is selected
 *  0b010100..PWM0_SM2_OUT_TRIG0 input is selected
 *  0b010101..PWM0_SM2_OUT_TRIG1 input is selected
 *  0b010110..Reserved
 *  0b010111..Reserved
 *  0b011000..TRIG_IN0 input is selected
 *  0b011001..TRIG_IN1 input is selected
 *  0b011010..TRIG_IN2 input is selected
 *  0b011011..TRIG_IN3 input is selected
 *  0b011100..TRIG_IN4 input is selected
 *  0b011101..TRIG_IN5 input is selected
 *  0b011110..TRIG_IN6 input is selected
 *  0b011111..TRIG_IN7 input is selected
 *  0b100000..TRIG_IN8 input is selected
 *  0b100001..TRIG_IN9 input is selected
 *  0b100010..TRIG_IN10 input is selected
 *  0b100011..TRIG_IN11 input is selected
 *  0b100100..GPIO0 Pin Event Trig 0 input is selected
 *  0b100101..GPIO1 Pin Event Trig 0 input is selected
 *  0b100110..GPIO2 Pin Event Trig 0 input is selected
 *  0b100111..GPIO3 Pin Event Trig 0 input is selected
 *  *..
 */
#define INPUTMUX_QDC0_HOME_INP(x)                (((uint32_t)(((uint32_t)(x)) << INPUTMUX_QDC0_HOME_INP_SHIFT)) & INPUTMUX_QDC0_HOME_INP_MASK)
/*! @} */

/*! @name QDC0_INDEX - QDC0 Trigger Input Connections */
/*! @{ */

#define INPUTMUX_QDC0_INDEX_INP_MASK             (0x3FU)
#define INPUTMUX_QDC0_INDEX_INP_SHIFT            (0U)
/*! INP - QDC0 input connections
 *  0b000000..Reserved
 *  0b000001..ARM_TXEV input is selected
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..CMP1_OUT input is selected
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT2 input is selected
 *  0b001010..CTimer0_MAT3 input is selected
 *  0b001011..CTimer1_MAT2 input is selected
 *  0b001100..CTimer1_MAT3 input is selected
 *  0b001101..CTimer2_MAT2 input is selected
 *  0b001110..CTimer2_MAT3 input is selected
 *  0b001111..QDC0_POS_MATCH0 input is selected
 *  0b010000..PWM0_SM0_OUT_TRIG0 input is selected
 *  0b010001..PWM0_SM0_OUT_TRIG1 input is selected
 *  0b010010..PWM0_SM1_OUT_TRIG0 input is selected
 *  0b010011..PWM0_SM1_OUT_TRIG1 input is selected
 *  0b010100..PWM0_SM2_OUT_TRIG0 input is selected
 *  0b010101..PWM0_SM2_OUT_TRIG1 input is selected
 *  0b010110..Reserved
 *  0b010111..Reserved
 *  0b011000..TRIG_IN0 input is selected
 *  0b011001..TRIG_IN1 input is selected
 *  0b011010..TRIG_IN2 input is selected
 *  0b011011..TRIG_IN3 input is selected
 *  0b011100..TRIG_IN4 input is selected
 *  0b011101..TRIG_IN5 input is selected
 *  0b011110..TRIG_IN6 input is selected
 *  0b011111..TRIG_IN7 input is selected
 *  0b100000..TRIG_IN8 input is selected
 *  0b100001..TRIG_IN9 input is selected
 *  0b100010..TRIG_IN10 input is selected
 *  0b100011..TRIG_IN11 input is selected
 *  0b100100..GPIO0 Pin Event Trig 0 input is selected
 *  0b100101..GPIO1 Pin Event Trig 0 input is selected
 *  0b100110..GPIO2 Pin Event Trig 0 input is selected
 *  0b100111..GPIO3 Pin Event Trig 0 input is selected
 *  *..
 */
#define INPUTMUX_QDC0_INDEX_INP(x)               (((uint32_t)(((uint32_t)(x)) << INPUTMUX_QDC0_INDEX_INP_SHIFT)) & INPUTMUX_QDC0_INDEX_INP_MASK)
/*! @} */

/*! @name QDC0_PHASEB - QDC0 Trigger Input Connections */
/*! @{ */

#define INPUTMUX_QDC0_PHASEB_INP_MASK            (0x3FU)
#define INPUTMUX_QDC0_PHASEB_INP_SHIFT           (0U)
/*! INP - QDC0 input connections
 *  0b000000..Reserved
 *  0b000001..ARM_TXEV input is selected
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..CMP1_OUT input is selected
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT2 input is selected
 *  0b001010..CTimer0_MAT3 input is selected
 *  0b001011..CTimer1_MAT2 input is selected
 *  0b001100..CTimer1_MAT3 input is selected
 *  0b001101..CTimer2_MAT2 input is selected
 *  0b001110..CTimer2_MAT3 input is selected
 *  0b001111..QDC0_POS_MATCH0 input is selected
 *  0b010000..PWM0_SM0_OUT_TRIG0 input is selected
 *  0b010001..PWM0_SM0_OUT_TRIG1 input is selected
 *  0b010010..PWM0_SM1_OUT_TRIG0 input is selected
 *  0b010011..PWM0_SM1_OUT_TRIG1 input is selected
 *  0b010100..PWM0_SM2_OUT_TRIG0 input is selected
 *  0b010101..PWM0_SM2_OUT_TRIG1 input is selected
 *  0b010110..Reserved
 *  0b010111..Reserved
 *  0b011000..TRIG_IN0 input is selected
 *  0b011001..TRIG_IN1 input is selected
 *  0b011010..TRIG_IN2 input is selected
 *  0b011011..TRIG_IN3 input is selected
 *  0b011100..TRIG_IN4 input is selected
 *  0b011101..TRIG_IN5 input is selected
 *  0b011110..TRIG_IN6 input is selected
 *  0b011111..TRIG_IN7 input is selected
 *  0b100000..TRIG_IN8 input is selected
 *  0b100001..TRIG_IN9 input is selected
 *  0b100010..TRIG_IN10 input is selected
 *  0b100011..TRIG_IN11 input is selected
 *  0b100100..GPIO0 Pin Event Trig 0 input is selected
 *  0b100101..GPIO1 Pin Event Trig 0 input is selected
 *  0b100110..GPIO2 Pin Event Trig 0 input is selected
 *  0b100111..GPIO3 Pin Event Trig 0 input is selected
 *  *..
 */
#define INPUTMUX_QDC0_PHASEB_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_QDC0_PHASEB_INP_SHIFT)) & INPUTMUX_QDC0_PHASEB_INP_MASK)
/*! @} */

/*! @name QDC0_PHASEA - QDC0 Trigger Input Connections */
/*! @{ */

#define INPUTMUX_QDC0_PHASEA_INP_MASK            (0x3FU)
#define INPUTMUX_QDC0_PHASEA_INP_SHIFT           (0U)
/*! INP - QDC0 input connections
 *  0b000000..Reserved
 *  0b000001..ARM_TXEV input is selected
 *  0b000010..AOI0_OUT0 input is selected
 *  0b000011..AOI0_OUT1 input is selected
 *  0b000100..AOI0_OUT2 input is selected
 *  0b000101..AOI0_OUT3 input is selected
 *  0b000110..CMP0_OUT input is selected
 *  0b000111..CMP1_OUT input is selected
 *  0b001000..Reserved
 *  0b001001..CTimer0_MAT2 input is selected
 *  0b001010..CTimer0_MAT3 input is selected
 *  0b001011..CTimer1_MAT2 input is selected
 *  0b001100..CTimer1_MAT3 input is selected
 *  0b001101..CTimer2_MAT2 input is selected
 *  0b001110..CTimer2_MAT3 input is selected
 *  0b001111..QDC0_POS_MATCH0 input is selected
 *  0b010000..PWM0_SM0_OUT_TRIG0 input is selected
 *  0b010001..PWM0_SM0_OUT_TRIG1 input is selected
 *  0b010010..PWM0_SM1_OUT_TRIG0 input is selected
 *  0b010011..PWM0_SM1_OUT_TRIG1 input is selected
 *  0b010100..PWM0_SM2_OUT_TRIG0 input is selected
 *  0b010101..PWM0_SM2_OUT_TRIG1 input is selected
 *  0b010110..Reserved
 *  0b010111..Reserved
 *  0b011000..TRIG_IN0 input is selected
 *  0b011001..TRIG_IN1 input is selected
 *  0b011010..TRIG_IN2 input is selected
 *  0b011011..TRIG_IN3 input is selected
 *  0b011100..TRIG_IN4 input is selected
 *  0b011101..TRIG_IN5 input is selected
 *  0b011110..TRIG_IN6 input is selected
 *  0b011111..TRIG_IN7 input is selected
 *  0b100000..TRIG_IN8 input is selected
 *  0b100001..TRIG_IN9 input is selected
 *  0b100010..TRIG_IN10 input is selected
 *  0b100011..TRIG_IN11 input is selected
 *  0b100100..GPIO0 Pin Event Trig 0 input is selected
 *  0b100101..GPIO1 Pin Event Trig 0 input is selected
 *  0b100110..GPIO2 Pin Event Trig 0 input is selected
 *  0b100111..GPIO3 Pin Event Trig 0 input is selected
 *  *..
 */
#define INPUTMUX_QDC0_PHASEA_INP(x)              (((uint32_t)(((uint32_t)(x)) << INPUTMUX_QDC0_PHASEA_INP_SHIFT)) & INPUTMUX_QDC0_PHASEA_INP_MASK)
/*! @} */

